Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.mcp.agentSetup.security.help
source: Installation prompts contain no long-term credential. Pair only trusted devices and review the confirmation shown by Starcat.
ar: لا تحتوي مطالبات التثبيت على اعتماد طويل الأجل. قم باقتران الأجهزة الموثوقة فقط وراجع التأكيد الذي يظهره Starcat.
de: Installations-Prompts enthalten keine langfristigen Anmeldeinformationen. Paaren Sie nur vertrauenswürdige Geräte und überprüfen Sie die von Starcat angezeigte Bestätigung.
es: Las indicaciones de instalación no contienen credenciales a largo plazo. Empareja solo dispositivos de confianza y revisa la confirmación mostrada por Starcat.
fr: Les invites d'installation ne contiennent aucune information d'identification à long terme. Appairez uniquement des appareils de confiance et examinez la confirmation affichée par Starcat.
id: Prompt instalasi tidak mengandung kredensial jangka panjang. Pasangkan hanya perangkat tepercaya dan tinjau konfirmasi yang ditampilkan oleh Starcat.
it: I prompt di installazione non contengono credenziali a lungo termine. Abbina solo dispositivi fidati e verifica la conferma mostrata da Starcat.
ja: インストールプロンプトには長期的な資格情報は含まれません。信頼できるデバイスのみをペアリングし、Starcatに表示される確認を確認してください。
ko: 설치 프롬프트에는 장기 자격 증명이 포함되어 있지 않습니다. 신뢰할 수 있는 장치만 페어링하고 Starcat에 표시된 확인 내용을 검토하세요.
nl: Installatieprompts bevatten geen langdurige inloggegevens. Koppel alleen vertrouwde apparaten en controleer de bevestiging die door Starcat wordt getoond.
pl: Prompty instalacyjne nie zawierają długoterminowych poświadczeń. Paruj tylko zaufane urządzenia i sprawdź potwierdzenie wyświetlane przez Starcat.
pt_br: Os comandos de instalação não contêm credenciais de longo prazo. Emparelhe apenas dispositivos confiáveis e revise a confirmação mostrada pelo Starcat.
ru: Запросы на установку не содержат долгосрочных учётных данных. Выполняйте сопряжение только с доверенными устройствами и проверяйте подтверждение, отображаемое Starcat.
tr: Kurulum istemleri uzun vadeli kimlik bilgisi içermez. Yalnızca güvenilir cihazları eşleyin ve Starcat tarafından gösterilen onayı inceleyin.
uk: Запити на встановлення не містять довгострокових облікових даних. Сполучайте лише довірені пристрої та перевіряйте підтвердження, яке показує Starcat.
vi: Lời nhắc cài đặt không chứa thông tin xác thực dài hạn. Chỉ ghép nối các thiết bị đáng tin cậy và xem lại xác nhận được hiển thị bởi Starcat.
zh_hans: 安装说明不包含长期凭据。请只配对可信设备，并核对 Starcat 显示的确认信息。
zh_hant: 安裝提示不包含長期憑證。僅配對受信任的裝置，並核對 Starcat 顯示的確認資訊。

# settings.mcp.agentSetup.skill.agent.copy
source: Copy Agent Prompt
ar: نسخ مطالبة الوكيل
de: Agent-Prompt kopieren
es: Copiar indicación para agente
fr: Copier l'invite pour l'agent
id: Salin Prompt Agen
it: Copia prompt agente
ja: エージェントプロンプトをコピー
ko: 에이전트 프롬프트 복사
nl: Agentprompt kopiëren
pl: Kopiuj prompt agenta
pt_br: Copiar Comando do Agente
ru: Копировать запрос для агента
tr: Aracı İstemini Kopyala
uk: Копіювати запит для агента
vi: Sao chép lời nhắc tác nhân
zh_hans: 复制 Agent Prompt
zh_hant: 複製 Agent Prompt

# settings.mcp.agentSetup.skill.agent.help
source: Copy a short request that lets an AI agent install starcat-skill from its public repository.
ar: انسخ طلبًا قصيرًا يسمح لوكيل الذكاء الاصطناعي بتثبيت starcat-skill من مستودعه العام.
de: Kopieren Sie eine kurze Anfrage, die einem KI-Agenten ermöglicht, starcat-skill aus seinem öffentlichen Repository zu installieren.
es: Copia una solicitud breve que permita a un agente de IA instalar starcat-skill desde su repositorio público.
fr: Copiez une courte demande qui permet à un agent IA d'installer starcat-skill depuis son dépôt public.
id: Salin permintaan pendek yang memungkinkan agen AI menginstal starcat-skill dari repositori publiknya.
it: Copia una breve richiesta che consente a un agente AI di installare starcat-skill dal suo repository pubblico.
ja: AIエージェントが公開リポジトリからstarcat-skillをインストールできる短いリクエストをコピーします。
ko: AI 에이전트가 공개 저장소에서 starcat-skill을 설치할 수 있는 짧은 요청을 복사합니다.
nl: Kopieer een kort verzoek waarmee een AI-agent starcat-skill kan installeren vanuit de openbare repository.
pl: Skopiuj krótkie żądanie, które pozwoli agentowi AI zainstalować starcat-skill z jego publicznego repozytorium.
pt_br: Copie uma solicitação curta que permite que um agente de IA instale o starcat-skill a partir de seu repositório público.
ru: Скопируйте короткий запрос, который позволит ИИ-агенту установить starcat-skill из его публичного репозитория.
tr: Bir yapay zeka aracısının starcat-skill'i genel deposundan yüklemesini sağlayan kısa bir isteği kopyalayın.
uk: Скопіюйте короткий запит, який дозволяє AI-агенту встановити starcat-skill з його публічного репозиторію.
vi: Sao chép một yêu cầu ngắn để tác nhân AI cài đặt starcat-skill từ kho lưu trữ công khai của nó.
zh_hans: 复制简短请求，让 AI Agent 从公开仓库安装 starcat-skill。
zh_hant: 複製簡短請求，讓 AI Agent 從其公開儲存庫安裝 starcat-skill。

# settings.mcp.agentSetup.skill.agent.title
source: Install with an AI Agent
ar: التثبيت باستخدام وكيل ذكاء اصطناعي
de: Mit einem KI-Agenten installieren
es: Instalar con un agente de IA
fr: Installer avec un agent IA
id: Instal dengan Agen AI
it: Installa con un agente AI
ja: AIエージェントでインストール
ko: AI 에이전트로 설치
nl: Installeren met een AI-agent
pl: Zainstaluj za pomocą agenta AI
pt_br: Instalar com um Agente de IA
ru: Установить через ИИ-агента
tr: Bir Yapay Zeka Aracısı ile Kur
uk: Встановити за допомогою AI-агента
vi: Cài đặt bằng tác nhân AI
zh_hans: 使用 AI Agent 安装
zh_hant: 使用 AI Agent 安裝

# settings.mcp.agentSetup.skill.manual.copy
source: Copy Manual Setup
ar: نسخ الإعداد اليدوي
de: Manuelle Einrichtung kopieren
es: Copiar configuración manual
fr: Copier la configuration manuelle
id: Salin Pengaturan Manual
it: Copia configurazione manuale
ja: 手動セットアップをコピー
ko: 수동 설정 복사
nl: Handmatige installatie kopiëren
pl: Kopiuj konfigurację ręczną
pt_br: Copiar Configuração Manual
ru: Копировать ручную установку
tr: Manuel Kurulumu Kopyala
uk: Копіювати ручне налаштування
vi: Sao chép thiết lập thủ công
zh_hans: 复制手动安装说明
zh_hant: 複製手動安裝說明

# settings.mcp.agentSetup.skill.manual.help
source: Copy commands for installing the public repository into the Codex or Claude Code user-level skill directory.
ar: انسخ أوامر تثبيت المستودع العام في دليل المهارات على مستوى المستخدم لـ Codex أو Claude Code.
de: Kopieren Sie Befehle zum Installieren des öffentlichen Repositorys in das benutzerebene Skill-Verzeichnis von Codex oder Claude Code.
es: Copia comandos para instalar el repositorio público en el directorio de habilidades a nivel de usuario de Codex o Claude Code.
fr: Copiez les commandes pour installer le dépôt public dans le répertoire de compétences au niveau utilisateur de Codex ou Claude Code.
id: Salin perintah untuk menginstal repositori publik ke direktori skill tingkat pengguna Codex atau Claude Code.
it: Copia i comandi per installare il repository pubblico nella directory delle skill a livello utente di Codex o Claude Code.
ja: 公開リポジトリをCodexまたはClaude Codeのユーザーレベルのスキルディレクトリにインストールするコマンドをコピーします。
ko: Codex 또는 Claude Code 사용자 수준 스킬 디렉토리에 공개 저장소를 설치하는 명령을 복사합니다.
nl: Kopieer opdrachten voor het installeren van de openbare repository in de vaardighedendirectory op gebruikersniveau van Codex of Claude Code.
pl: Skopiuj polecenia do instalacji publicznego repozytorium w katalogu umiejętności na poziomie użytkownika Codex lub Claude Code.
pt_br: Copie comandos para instalar o repositório público no diretório de skills em nível de usuário do Codex ou Claude Code.
ru: Скопируйте команды для установки публичного репозитория в каталог навыков Codex или Claude Code на уровне пользователя.
tr: Genel depoyu Codex veya Claude Code kullanıcı düzeyi beceri dizinine yüklemek için komutları kopyalayın.
uk: Скопіюйте команди для встановлення публічного репозиторію в каталог навичок Codex або Claude Code на рівні користувача.
vi: Sao chép lệnh để cài đặt kho lưu trữ công khai vào thư mục kỹ năng cấp người dùng của Codex hoặc Claude Code.
zh_hans: 复制命令，将公开仓库安装到 Codex 或 Claude Code 的用户级 Skill 目录。
zh_hant: 複製命令，將公開儲存庫安裝到 Codex 或 Claude Code 的使用者級 skill 目錄。

# settings.mcp.agentSetup.skill.manual.title
source: Install it yourself
ar: ثبّته بنفسك
de: Selbst installieren
es: Instalarlo tú mismo
fr: Installer vous-même
id: Instal sendiri
it: Installalo manualmente
ja: 自分でインストール
ko: 직접 설치
nl: Zelf installeren
pl: Zainstaluj samodzielnie
pt_br: Instalar você mesmo
ru: Установить самостоятельно
tr: Kendiniz kurun
uk: Встановити самостійно
vi: Tự cài đặt
zh_hans: 自行安装
zh_hant: 自行安裝

# settings.mcp.agentSetup.skill.title
source: Install starcat-skill
ar: تثبيت starcat-skill
de: starcat-skill installieren
es: Instalar starcat-skill
fr: Installer starcat-skill
id: Instal starcat-skill
it: Installa starcat-skill
ja: starcat-skillをインストール
ko: starcat-skill 설치
nl: starcat-skill installeren
pl: Zainstaluj starcat-skill
pt_br: Instalar starcat-skill
ru: Установить starcat-skill
tr: starcat-skill'i Kur
uk: Встановити starcat-skill
vi: Cài đặt starcat-skill
zh_hans: 安装 starcat-skill
zh_hant: 安裝 starcat-skill

# settings.mcp.agentSetup.skillManualPrompt
source: # Install starcat-skill Manually Choose one user-level destination. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` If the destination already exists, update it with `git -C <skill-path> pull --ff-only`. Restart or reload the AI agent so it refreshes the Skill list, then invoke `$starcat-skill` with a read-only request to verify discovery.
ar: # تثبيت starcat-skill يدويًا اختر وجهة واحدة على مستوى المستخدم. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` إذا كانت الوجهة موجودة بالفعل، قم بتحديثها باستخدام `git -C <skill-path> pull --ff-only`. أعد تشغيل وكيل الذكاء الاصطناعي أو أعد تحميله حتى يقوم بتحديث قائمة المهارات، ثم استدعِ `$starcat-skill` مع طلب للقراءة فقط للتحقق من الاكتشاف.
de: # starcat-skill manuell installieren Wählen Sie ein benutzerebenes Ziel. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Wenn das Ziel bereits existiert, aktualisieren Sie es mit `git -C <skill-path> pull --ff-only`. Starten Sie den KI-Agenten neu oder laden Sie ihn neu, damit er die Skill-Liste aktualisiert, und rufen Sie dann `$starcat-skill` mit einer schreibgeschützten Anfrage auf, um die Erkennung zu überprüfen.
es: # Instalar starcat-skill manualmente Elige un destino a nivel de usuario. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Si el destino ya existe, actualízalo con `git -C <skill-path> pull --ff-only`. Reinicia o recarga el agente de IA para que actualice la lista de habilidades, luego invoca `$starcat-skill` con una solicitud de solo lectura para verificar el descubrimiento.
fr: # Installer starcat-skill manuellement Choisissez une destination au niveau utilisateur. Codex : ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code : ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Si la destination existe déjà, mettez-la à jour avec `git -C <skill-path> pull --ff-only`. Redémarrez ou rechargez l'agent IA pour qu'il actualise la liste des compétences, puis invoquez `$starcat-skill` avec une demande en lecture seule pour vérifier la découverte.
id: # Instal starcat-skill Secara Manual Pilih satu tujuan tingkat pengguna. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Jika tujuan sudah ada, perbarui dengan `git -C <skill-path> pull --ff-only`. Mulai ulang atau muat ulang agen AI agar menyegarkan daftar Skill, lalu panggil `$starcat-skill` dengan permintaan hanya-baca untuk memverifikasi penemuan.
it: # Installa starcat-skill manualmente Scegli una destinazione a livello utente. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Se la destinazione esiste già, aggiornala con `git -C <skill-path> pull --ff-only`. Riavvia o ricarica l'agente AI per aggiornare l'elenco delle skill, quindi invoca `$starcat-skill` con una richiesta di sola lettura per verificare il rilevamento.
ja: # starcat-skillを手動でインストール ユーザーレベルの保存先を1つ選択してください。 Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` 保存先が既に存在する場合は、`git -C <skill-path> pull --ff-only` で更新してください。AIエージェントを再起動またはリロードしてスキルリストを更新し、読み取り専用リクエストで `$starcat-skill` を呼び出して検出を確認してください。
ko: # starcat-skill 수동 설치 사용자 수준 대상을 하나 선택하세요. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` 대상이 이미 존재하는 경우 `git -C <skill-path> pull --ff-only`로 업데이트하세요. AI 에이전트를 다시 시작하거나 다시 로드하여 스킬 목록을 새로고침한 다음 읽기 전용 요청으로 `$starcat-skill`을 호출하여 검색을 확인하세요.
nl: # starcat-skill handmatig installeren Kies een bestemming op gebruikersniveau. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Als de bestemming al bestaat, werk deze dan bij met `git -C <skill-path> pull --ff-only`. Start de AI-agent opnieuw of laad deze opnieuw zodat de vaardighedenenlijst wordt ververst, roep vervolgens `$starcat-skill` aan met een alleen-lezen verzoek om de detectie te verifiëren.
pl: # Ręczna instalacja starcat-skill Wybierz jeden katalog docelowy na poziomie użytkownika. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Jeśli katalog docelowy już istnieje, zaktualizuj go za pomocą `git -C <skill-path> pull --ff-only`. Uruchom ponownie lub przeładuj agenta AI, aby odświeżył listę umiejętności, a następnie wywołaj `$starcat-skill` z żądaniem tylko do odczytu, aby zweryfikować wykrycie.
pt_br: # Instalar starcat-skill Manualmente Escolha um destino em nível de usuário. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Se o destino já existir, atualize-o com `git -C <skill-path> pull --ff-only`. Reinicie ou recarregue o agente de IA para que ele atualize a lista de Skills e, em seguida, invoque `$starcat-skill` com uma solicitação somente leitura para verificar a descoberta.
ru: # Установка starcat-skill вручную Выберите один каталог назначения на уровне пользователя. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Если каталог назначения уже существует, обновите его с помощью `git -C <skill-path> pull --ff-only`. Перезапустите или перезагрузите ИИ-агента, чтобы он обновил список навыков, затем вызовите `$starcat-skill` с запросом только для чтения, чтобы проверить обнаружение.
tr: # starcat-skill'i Manuel Olarak Kur Bir kullanıcı düzeyi hedef seçin. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Hedef zaten mevcutsa, `git -C <skill-path> pull --ff-only` ile güncelleyin. Yapay zeka aracısını yeniden başlatın veya yeniden yükleyin, böylece Beceri listesini yeniler, ardından keşfi doğrulamak için salt okunur bir istekle `$starcat-skill`'i çağırın.
uk: # Встановлення starcat-skill вручну Виберіть один каталог призначення на рівні користувача. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Якщо каталог призначення вже існує, оновіть його за допомогою `git -C <skill-path> pull --ff-only`. Перезапустіть або перезавантажте AI-агента, щоб він оновив список навичок, потім викличте `$starcat-skill` із запитом лише для читання, щоб перевірити виявлення.
vi: # Cài đặt starcat-skill thủ công Chọn một đích đến cấp người dùng. Codex: ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code: ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` Nếu đích đến đã tồn tại, hãy cập nhật nó bằng `git -C <skill-path> pull --ff-only`. Khởi động lại hoặc tải lại tác nhân AI để làm mới danh sách Kỹ năng, sau đó gọi `$starcat-skill` với yêu cầu chỉ đọc để xác minh khả năng phát hiện.
zh_hans: # 手动安装 starcat-skill 选择一个用户级安装目录。 Codex： ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code： ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` 如果目标目录已存在，请使用 `git -C <skill-path> pull --ff-only` 更新。随后重启或重新加载 AI Agent，让它刷新 Skill 列表，再通过 `$starcat-skill` 发起一个只读请求验证是否已识别。
zh_hant: # 手動安裝 starcat-skill 選擇一個使用者級目標。 Codex： ```bash mkdir -p "$HOME/.codex/skills" git clone %1$@ "$HOME/.codex/skills/starcat-skill" ``` Claude Code： ```bash mkdir -p "$HOME/.claude/skills" git clone %1$@ "$HOME/.claude/skills/starcat-skill" ``` 如果目標已存在，請使用 `git -C <skill-path> pull --ff-only` 更新。重新啟動或重新載入 AI Agent 以重新整理 Skill 列表，然後使用唯讀請求呼叫 `$starcat-skill` 以驗證探索。

# settings.mcp.agentSetup.skillPrompt
source: Please install starcat-skill: %1$@
ar: يرجى تثبيت starcat-skill: %1$@
de: Bitte installieren Sie starcat-skill: %1$@
es: Por favor, instala starcat-skill: %1$@
fr: Veuillez installer starcat-skill : %1$@
id: Silakan instal starcat-skill: %1$@
it: Per favore installa starcat-skill: %1$@
ja: starcat-skillをインストールしてください: %1$@
ko: starcat-skill을 설치해 주세요: %1$@
nl: Installeer starcat-skill: %1$@
pl: Zainstaluj starcat-skill: %1$@
pt_br: Por favor, instale o starcat-skill: %1$@
ru: Пожалуйста, установите starcat-skill: %1$@
tr: Lütfen starcat-skill'i yükleyin: %1$@
uk: Будь ласка, встановіть starcat-skill: %1$@
vi: Vui lòng cài đặt starcat-skill: %1$@
zh_hans: 请帮我安装 starcat-skill：%1$@
zh_hant: 請安裝 starcat-skill：%1$@

# settings.mcp.batchWrites.help
source: Allow future batch write tools to update multiple repositories in one request. P0 write tools still use per-request limits.
ar: السماح لأدوات الكتابة المجمعة المستقبلية بتحديث مستودعات متعددة في طلب واحد. لا تزال أدوات الكتابة P0 تستخدم حدودًا لكل طلب.
de: Erlauben Sie zukünftigen Batch-Schreib-Tools, mehrere Repositorys in einer Anfrage zu aktualisieren. P0-Schreib-Tools verwenden weiterhin Limits pro Anfrage.
es: Permite que futuras herramientas de escritura por lotes actualicen múltiples repositorios en una sola solicitud. Las herramientas de escritura P0 aún usan límites por solicitud.
fr: Autoriser les futurs outils d'écriture par lots à mettre à jour plusieurs dépôts en une seule demande. Les outils d'écriture P0 utilisent toujours des limites par demande.
id: Izinkan alat tulis batch di masa mendatang untuk memperbarui beberapa repositori dalam satu permintaan. Alat tulis P0 masih menggunakan batas per permintaan.
it: Consenti ai futuri strumenti di scrittura batch di aggiornare più repository in una singola richiesta. Gli strumenti di scrittura P0 utilizzano ancora limiti per richiesta.
ja: 将来のバッチ書き込みツールが1回のリクエストで複数のリポジトリを更新できるようにします。P0書き込みツールは引き続きリクエストごとの制限を使用します。
ko: 향후 배치 쓰기 도구가 하나의 요청으로 여러 저장소를 업데이트할 수 있도록 허용합니다. P0 쓰기 도구는 여전히 요청당 제한을 사용합니다.
nl: Toekomstige batch-schrijftools toestaan om meerdere repositories in één verzoek bij te werken. P0-schrijftools gebruiken nog steeds limieten per verzoek.
pl: Zezwól przyszłym narzędziom do zapisu wsadowego na aktualizowanie wielu repozytoriów w jednym żądaniu. Narzędzia zapisu P0 nadal używają limitów na żądanie.
pt_br: Permitir que futuras ferramentas de gravação em lote atualizem vários repositórios em uma única solicitação. As ferramentas de gravação P0 ainda usam limites por solicitação.
ru: Разрешить будущим инструментам пакетной записи обновлять несколько репозиториев за один запрос. Инструменты записи P0 по-прежнему используют ограничения на запрос.
tr: Gelecekteki toplu yazma araçlarının tek bir istekte birden çok depoyu güncellemesine izin ver. P0 yazma araçları hâlâ istek başına sınırlar kullanır.
uk: Дозволити майбутні інструменти пакетного запису для оновлення кількох репозиторіїв в одному запиті. Інструменти запису P0 все ще використовують обмеження на запит.
vi: Cho phép các công cụ ghi hàng loạt trong tương lai cập nhật nhiều kho lưu trữ trong một yêu cầu. Các công cụ ghi P0 vẫn sử dụng giới hạn theo yêu cầu.
zh_hans: 允许后续批量写入工具在一次请求中更新多个仓库。P0 写入工具仍按单次请求限制执行。
zh_hant: 允許後續批次寫入工具在一次請求中更新多個儲存庫。P0 寫入工具仍使用每次請求的限制。

# settings.mcp.batchWrites.title
source: Allow batch writes
ar: السماح بالكتابة المجمعة
de: Batch-Schreibvorgänge erlauben
es: Permitir escrituras por lotes
fr: Autoriser les écritures par lots
id: Izinkan tulis batch
it: Consenti scritture batch
ja: バッチ書き込みを許可
ko: 배치 쓰기 허용
nl: Batchschrijfbewerkingen toestaan
pl: Zezwól na zapisy wsadowe
pt_br: Permitir gravações em lote
ru: Разрешить пакетную запись
tr: Toplu yazmalara izin ver
uk: Дозволити пакетний запис
vi: Cho phép ghi hàng loạt
zh_hans: 允许批量写入
zh_hant: 允許批次寫入
